chore: format src and docs
Signed-off-by: Thomas Tran <tldinteractive@gmail.com>
